const Mainpage = {template:`
  <div>
  <div class="midasi">
  <h2>ぽんちゃんとの素敵な日常です('ω')</h2>
  <p>
    学生の頃ほど遊ぶことは少なくなってしまいましたが、二人暮らしをするために
    節約しながら自分たちなりにハッピーな日々を送っております(^O^)
  </p>
　</div>
<div class="cocontents">
  <h3>ぽんちゃんとは</h3>
  <p　class="sentence">今年の四月から新社会人の赤ちゃんのような女の子です。<br>
  うさまると乃木坂46が大好きで散歩中にいきなりおどりだしたり、,<br>
突然、「ぷんぬ」などと口に出したり、ふしぎな女の子です。</p>
　</div>
</div>`};

const Nanayon = {template:`
<div>

      <div class="midasi">
        <h2>ぽんちゃんとの素敵な日常です('ω')</h2>
    　</div>
      <div class="cocontents">
        <h3>July 4</h3>
        <h4>ブルーライト眼鏡作ったyo</h4>
        <p　class="sentence">少しゆっくりめに集合しぽんちゃんのブルーライトカット用の眼鏡の作成に付き合ってもらいました。<br>
        その後Lalinでボディスクラブの体験を受け、お店から出ると、グラニフで長場雄さんとのコラボ
      を発見、すかさず購入しました。<br>お昼ご飯はたこ焼きをたべ、快活クラブでだらだらしたあと
    　ミライザカという居酒屋さんに入りました。土曜日ということで店内は満席でしたが、お料理の提供も早くおいしかったです。<br>
    卵焼きの明太マヨチーズのせが絶品でした。<br>
    ぽんちゃんは小食なのでチキン南蛮を食べずに梅チューハイに入っている梅干しを潰して喜んでいました。<br><br><br><br><br><br><br><br><br><br></p>


      </div>

</div>
  `};


const Nanaititi = {
  template:`
  <div>
  <div class="midasi">
         <h2>ぽんちゃんとの素敵な日常です('ω')</h2>
     　</div>
       <div class="cocontents">
         <h3>July 11</h3>
         <h4>ぽんちゃん髪きってたyo</h4>
         <p　class="sentence">今日はぽんちゃんが午前中、美容院ということで午後からの集合になりました。<br>
         縮毛矯正をしたらしく髪の毛が真っ直ぐでトゥルントゥルンになっていました(^^)/<br>
       午前中は豪雨でしたが午後は止んでおり、<br>油断してふたりとも傘を忘れてしまい雨が降らないことを祈りながらお散歩をしました。<br>
     一度行ってみたかったTOOTH TOOTH のカフェに行くもケーキが完売!!<br>ということでbocksunというケーキ屋さんに入りました。<br>
   ぽんちゃんは欲張ってケーキを二つ頼みましたが<br>食べきれず私に託しお腹が痛いとごねていました('ω')<br>
 タイミングが良く、お店に入ると外は大雨でしたが出るころには雨が止み、<br>傘がなくても乗り越えられた一日でした。<br>
 再来週のちょっとした贅沢企画がお寿司のランチに決まり、いまからわくわくが止まらない('ω')<br>
 来週は映画館でやっているジブリの再上映をみにいきたいですね('ω')</p>


 </div>
 </div>

`
};

const Nanaitihati = {
  template:`

  <div>
    <div class="midasi">
          <h2>ぽんちゃんとの素敵な日常です('ω')</h2>
      　</div>
        <div class="cocontents">
          <h3>July 18</h3>
          <h4>風の谷のナウシカ見てきたyo</h4>
          <p　class="sentence">今日はナウシカを見ようということで集合した後、すぐに映画のチケット
          を買いに行きました。<br>五時からの上映ということでそれまではぶらぶらしてました('ω')<br>
          みたらし団子が食べたかったので炎天下のなか、<br>二宮町の月ヶ瀬というお餅屋さんを目指して散策しました。<br>
          みたらし団子はタレももちろん美味しいのですが、<br>お餅の素朴な味がしっかりとしており
          とろーんとした食感でいくらでも食べれる美味しさでした！<br>
          ちなみにぽんちゃんが買ってくれました('ω')ありがとう('ω')<br>
          お昼ご飯は韓国冷麺を追い続け、結局、焼き肉六甲に決まりました。<br>
          私がカルビの脂を落とそうと焼いていると脂で火が大きくなり火事になるところでした('ω')<br>
          ぽんちゃんは冷麺を食べきれず私に差し出してトイレに去っていきました('ω')<br>
          ぽんちゃんのサンダル探しの旅も終え、ついにナウシカを鑑賞！<br>
          人間が汚染した大地を浄化するために腐海ができ、<br>蟲がその腐海を守っているという内容でした。<br>
          映画にされている部分は漫画の原作の７巻中の二巻分ということで<br>ぜひ原作も読んでみたいと思いました('ω')<br>
          晩御飯はスペイン料理を食べました。<br>
          やっぱりアヒージョはおいしい('ω')<br>ちなみにアヒージョはスペイン語で刻んだニンニクという意味らしいです('ω')<br>
          安定にぽんちゃんはお腹いっぱいといいながら<br>お肉食べれないということで私がお肉を食べました('ω')<br>
          最近ぽんちゃんは全然食べません('ω')<br>
          三日間、仕事を頑張ればまたぽんちゃんということで来週も頑張れそうです('ω')</p>


        </div>
  </div>


  `
};


const Nananisan = {
  template:`
  <div>
   <div class="midasi">
          <h2>ぽんちゃんとの素敵な日常です('ω')</h2>
      　</div>
        <div class="cocontents">
          <h3>July 23-25</h3>
          <h4>お寿司食べてリラックスしてきたyo</h4>
          <p　class="sentence">待ちに待ったぽんちゃんとプチ贅沢でした！<br>
          一日目は社会人頑張っているということで回らないお寿司に行ってきました('ω')<br>
          お店に入ると開店してすぐにも関わらず満員でびっくりしました。<br>
          一番おいしいと感じたのはマグロでした('ω')<br>食感も味も食べたことがない美味しさで回転寿司とはちがうなぁと思いました！<br>
          ぐつぐつ沸いている鍋から熱々の緑のお茶が出てきたのも新鮮でした('ω')<br>
          とても気になっていた芽ネギの握りは塩味のネギという感じで面白い味で、<br>
          ぽんちゃんは食べ終わった後も口の中がネギのにおいだと感動していました('ω')<br>
          その後、なんばパークスのなかを歩いていると、<br>ユーフォーキャッチャーで大好きなお文具さんたちを発見！！<br>
          2000円近く使ってしまいましたが無事お迎えすることが出来ました('ω')<br>
          一日目の晩御飯はスーパーマーケットでふたりとも好きなものを食べてぐっすり眠りました。<br>
          <br>
          二日目は早起きが癖づいてしまっているので七時に起床したのですが<br>10時頃までベッドでダラダラしていました。<br>
          少しだけ食糧調達で外に出ましたが<br>ほとんど部屋で相席食堂やおそ松さんとかを見ていました('ω')<br>
          ダラダラ最高('ω')<br>
          <br>
          三日目はチェックアウトの時間がギリギリで<br>
          ぽん氏はアメリカンドッグを食べながら部屋を出て<br>
          ゼリーを食べながら歩いていました('ω')<br>
          朝早く、お店も空いていないのでカラオケに行ったところ、<br>
          ぽんちゃんの勢いが止まらず三回くらい延長してました('ω')<br>
          お昼はエビフライがおいしいお店に行きました。<br>
          私は欲張ってコロッケを追加で注文したのですがお腹いっぱいで<br>
          なかなか大変でしたがぽんちゃんも手伝ってくれて無事、完食できました！<br>
          <br>
          ぽんちゃん、三日間ありがとう('ω')<br>
          なかなかフードファイトしちゃったね('ω')<br>
          私は夜中、二回もベッドからぽんちゃん落下を阻止したよ('ω')<br>
          一緒に住んだら自炊、頑張らないとね('ω')<br>
          楽しかった本当に感謝です('ω')<br>
          <br><br>
          実は次の日もぽんちゃんに会ました('ω')<br>
          </p>


        </div>
  </div>
  `
};

const Hatini = {
  template:`
  <div>
   <div class="midasi">
          <h2>ぽんちゃんとの素敵な日常です('ω')</h2>
      　</div>
        <div class="cocontennts">
          <h3>August 2</h3>
          <h4>尼崎探検してきたyo</h4>
          <p　class="sentence">
         本日は三宮も飽きたということで<br>何となく尼崎の商店街を探検してきました('ω')<br>
            私がいつも朝、 通勤するときには<br>鳩たちが噴水の周りでバタバタしているのですが<br>
            今日は梅雨も明け、真夏の日が差す12時ごろということで、<br>
            さすがの鳩たちも日光浴はしていませんでした<br>
            ぽんちゃんは日陰で餅のようになった鳩をみながら<br>暑さと戦っていましたが<br>
            暑さには惨敗してました('ω')<br>
            商店街は特に見るものもなく西宮にもどり<br>
            ジョリーパスタでランチをした後<br>
            ダーツとビリヤードで遊びました('ω')<br>
            ぽんちゃんはダーツが苦手のようで<br>楽しんでくれていたかわかりません('ω')<br>
            ビリヤードは以前した時よりもとても上手になっていて<br>
            私よりも上手いかもしれません！<br>
            あとはららぽーとをぶらぶらして帰りました。<br>
            遊び尽くしてあまりわくわくすることがないと思うのですが<br>
            いつも一緒にいてくれてありがとぽ('ω')<br>
            これからどんどん暑くなるので<br>水分補給はしっかりしましょう！<br>
            <br><br>ぽんちゃんに四畳半タイムマシーンブルースを渡してみました！<br>
            気に入ってくれたうれしいです('ω')<br>
            落ち着いたら京都の送り火見に行こうね('ω')<br>
          </p>


        </div>
  </div>
  `
};

const Hatinisan = {
  template:`
  <div>
    <div class="midasi">
          <h2>ぽんちゃんとの素敵な日常です('ω')</h2>
      　</div>
        <div class="cocontennts">
          <h3>August 23</h3>
          <h4>一緒に勉強してきたyo</h4>
          <p　class="sentence">今日はぽんちゃんと勉強dayということで<br>久しぶりのスターバックスに篭もりました！<br>
  私は最近持ち運べるノートパソコンが欲しくて<br>ネットで注文していたのですが<br>なかなか発送してくれないので<br>キャンセルして店頭で購入致しました！<br>ぽんちゃんには衝動買いやね！といわれましたが<br>ずっと欲しいと思っていたので計画買いです(＾ω＾)<br>
  3時間以上も勉強しており、<br>いつもぽんちゃんはすぐに疲れたといって<br>終わってしまうのですが、<br>この日は私が先に疲れてしまうくらい<br>ぽんちゃんが勉強しててビックリしました(＾ω＾)<br>
  久しぶりにスタバに行った感想ですが、<br>やっぱりサンマルク派やなぁと感じました。<br>
  椅子硬いし、机低いし、うるさいし(    ॑꒳ ॑   )<br>
  フラペチーノ飲むなら<br>その値段でサンマルクでコーヒーとパン食べるまる！<br>
  晩ご飯はイップニという韓国料理屋さんで食べました。<br>
  以前も入ったのですが美味しかったのでリピートしました(＾ω＾)<br>
  チーズタッカルビは小と中があり、<br>中を選んだのですが期待していた程、量はありませんでした！<br>
  これはもう一度自分たちで作るしかない！！<br>
  ということで今度の四連休は<br>チーズタッカルビ造りになりそうです(((o(*ﾟ▽ﾟ*)o)))<br>
          </p>


        </div>
  </div>`
};

const Kyuuniroku = {
  template:`

  <div>
      <div class="midasi">
        <h2>ぽんちゃんとの素敵な日常です('ω')</h2>
    　</div>
      <div class="cocontents">
        <h3>Septenber 26</h3>
        <h4>お散歩したyo</h4>
        <p　class="sentence">暑さもかなり落ち着いてきましてピクニック日和になってまいりました💪🏻( ¨̮ 💪🏻)<br>
    ぽんちゃんといつも通り三宮に集合し、まずロフトに化粧品を買いに行きました💪🏻( ¨̮ 💪🏻)<br>
    ぽんちゃんは新しく購入した香水をつけてきており、いつもより上機嫌でした(((o(*ﾟ▽ﾟ*)o)))<br>
    みなとの森のベンチに座りながら購入した化粧品を使うとぽんちゃんは満足げな顔をしていましたが、<br>
    わたしには変化があまりわかりませんでした(⍢)<br>
    二人で飲むヨーグルトとトマトジュースをのんでゆっくりした後、お昼ご飯探しの旅にでました。<br>
    ぽんちゃんのとても大好きなパン食べ放題の看板に吸い寄せられてパスタを食べました(((o(*ﾟ▽ﾟ*)o)))<br>
    フィットチーネのパスタを食べるのは初めてでしたが歯ごたえがしっかりしていてもちもちで<br>
    普通のパスタよりもフィットチーネ派になりました💪🏻( ¨̮ 💪🏻)<br>
    サイゼリア以外でペンネを食べたことがないので<br>
    次はおいしいペンネ探しにいきましょう💪🏻( ¨̮ 💪🏻)<br>
    ランチの後はumieまでお散歩しました。<br>
    メリケンパークにいる鳩たちは育ちが良い様でいつ見てもふわふわで可愛いので<br>
    ぽんちゃんが捕まえようとしていました💪🏻( ¨̮ 💪🏻)<br>
    夜ご飯はたこ焼きをたべました。<br>
    美味しそうなメニューがたくさんあるのでいっぱい食べようと思っていたのですが、<br>
    たこ焼きとフライドポテトでおなかいっぱいになってしまいました(⍢)<br>
    ハマっている赤玉パンチも飲めたので満足でした💪🏻( ¨̮ 💪🏻)<br>
    来週からは<br>
    11月の旅行に向けて計画も建てたいし、西成も行きたいし、動物王国もいきたいし、<br>
    なによりドライブの練習しないといけないですね💪🏻( ¨̮ 💪🏻)<br>
    </p>
      </div>
</div>
  `
};

const routes =[
  { path: '/',component:Mainpage },
  {path:'/7-4',component:Nanayon},
  {path:'/7-11',component:Nanaititi},
  {path:'/7-18',component:Nanaitihati},
  {path:'/7-23',component:Nananisan},
  {path:'/8-2',component:Hatini},
  {path:'/9-26',component:Kyuuniroku}
];

const router = new VueRouter({
  routes
});

const app = new Vue({
   router
 }).$mount('#app');
